In [2]:
import pandas as pd

# DataFrame = Rectangular data

<p><em>
    <code>head()</code> = First few rows of DataFrame </br>
    <code>info()</code> = Names and DType of columns </br>
    <code>describe()</code> = Quick overview of Numeric variables </br></br>    
    <code>shape</code> = No of rows and columns as a tuple </br>
    <code>values</code> = Returns the value of DataFrame in a 2D numpy array </br> 
    <code>columns</code> = column names </br>
    <code>index</code> = row nos or row names </br></br>    
    sort_values
    Subsetting columns</br>
    Subsetting rows</br>
    Adding new columns</br>
    Combining it all together
</em></p>

In [3]:
# Create DataFrame from a 2D Array
datarows = [
 ['East South Central', 'Alabama', 2570.0, 864.0, 4887681], ['Pacific', 'Alaska', 1434.0, 582.0, 735139], ['Mountain', 'Arizona', 7259.0, 2606.0, 7158024], ['West South Central', 'Arkansas', 2280.0, 432.0, 3009733], ['Pacific', 'California', 109008.0, 20964.0, 39461588], ['Mountain', 'Colorado', 7607.0, 3250.0, 5691287], 
 ['New England', 'Connecticut', 2280.0, 1696.0, 3571520], ['South Atlantic', 'Delaware', 708.0, 374.0, 965479], ['South Atlantic', 'District of Columbia', 3770.0 ,3134.0 ,701547], ['South Atlantic', 'Florida', 21443.0, 9587.0 ,21244317], ['South Atlantic','Georgia', 6943.0, 2556.0, 10511131], ['Pacific', 'Hawaii', 4131.0, 2399.0, 1420593],
 ['Mountain', 'Idaho', 1297.0, 715.0, 1750536], ['East North Central', 'Illinois' ,6752.0, 3891.0, 12723071], ['East North Central', 'Indiana', 3776.0, 1482.0, 6695497], ['West North Central', 'Iowa', 1711.0, 1038.0, 3148618], ['West North Central', 'Kansas', 1443.0, 773.0, 2911359], ['East South Central', 'Kentucky', 2735.0, 953.0, 4461153],
 ['West South Central', 'Louisiana', 2540.0, 519.0, 4659690], ['New England', 'Maine', 1450.0, 1066.0, 1339057], ['South Atlantic', 'Maryland', 4914.0, 2230.0, 6035802], ['New England', 'Massachusetts', 6811.0, 13257.0, 6882635], ['East North Central', 'Michigan', 5209.0 ,3142.0 ,9984072], ['West North Central', 'Minnesota', 3993.0, 3250.0, 5606249], 
 ['East South Central', 'Mississippi', 1024.0, 328.0, 2981020], ['West North Central', 'Missouri', 3776.0, 2107.0, 6121623], ['Mountain','Montana', 983.0, 422.0, 1060665], ['West North Central', 'Nebraska', 1745.0, 676.0, 1925614], ['Mountain', 'Nevada', 7058.0, 486.0, 3027341], ['New England', 'New Hampshire', 835.0, 615.0, 1353465], 
 ['Mid-Atlantic', 'New Jersey', 6048.0, 3350.0, 8886025], ['Mountain', 'New Mexico', 1949.0, 602.0, 2092741], ['Mid-Atlantic', 'New York', 39827.0, 52070.0, 19530351], ['South Atlantic', 'North Carolina', 6451.0, 2817.0, 10381615], ['West North Central', 'North Dakota', 467.0, 75.0, 758080], ['East North Central', 'Ohio', 6929.0,3320.0, 11676341], 
 ['West South Central', 'Oklahoma', 2823.0, 1048.0, 3940235], ['Pacific', 'Oregon', 11139.0, 3337.0, 4181886], ['Mid-Atlantic','Pennsylvania', 8163.0, 5349.0, 12800922], ['New England' ,'Rhode Island', 747.0, 354.0, 1058287], ['South Atlantic', 'South Carolina', 3082.0, 851.0, 5084156], ['West North Central', 'South Dakota', 836.0, 323.0, 878698], 
 ['East South Central', 'Tennessee', 6139.0, 1744.0, 6771631], ['West South Central', 'Texas', 19199.0, 6111.0, 28628666], ['Mountain', 'Utah', 1904.0, 972.0, 3153550], ['New England', 'Vermont', 780.0, 511.0, 624358], ['South Atlantic', 'Virginia', 3928.0, 2047.0, 8501286], ['Pacific', 'Washington', 16424.0, 5880.0, 7523869], 
 ['South Atlantic', 'West Virginia', 1021.0, 222.0, 1804291], ['East North Central', 'Wisconsin', 2740.0, 2167.0, 5807406], ['Mountain', 'Wyoming', 434.0, 205.0, 577601]
]

homelessness = pd.DataFrame(
    datarows, 
    columns = ['region', 'state', 'individuals', 'family_members', 'state_pop'],
    index   = [x for x in range(0,51,1)]
)

#Alternatively it can be loaded from csv as well.
#homelessness = pd.read_csv('Data/homelessness.csv', index_col=0)

In [4]:
homelessness.head()

               region       state  individuals  family_members  state_pop
0  East South Central     Alabama       2570.0           864.0    4887681
1             Pacific      Alaska       1434.0           582.0     735139
2            Mountain     Arizona       7259.0          2606.0    7158024
3  West South Central    Arkansas       2280.0           432.0    3009733
4             Pacific  California     109008.0         20964.0   39461588

In [85]:
homelessness.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 51 entries, 0 to 50
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   region          51 non-null     object
 1   state           51 non-null     object
 2   individuals     51 non-null     float64
 3   family_members  51 non-null     float64
 4   state_pop       51 non-null     int64
dtypes: float64(2), int64(1), object(2)
memory usage: 2.4+ KB

In [86]:
homelessness.describe()

         individuals  family_members     state_pop
count      51.000000       51.000000  5.100000e+01
mean     7225.784314     3504.882353  6.405637e+06
std     15991.025083     7805.411811  7.327258e+06
min       434.000000       75.000000  5.776010e+05
25%      1446.500000      592.000000  1.777414e+06
50%      3082.000000     1482.000000  4.461153e+06
75%      6781.500000     3196.000000  7.340946e+06
max    109008.000000    52070.000000  3.946159e+07

In [87]:
homelessness.shape

(51, 5)

In [88]:
homelessness.columns

Index(['region', 'state', 'individuals', 'family_members', 'state_pop'], dtype='object')

In [89]:
homelessness.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
            34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
            50],
           dtype='int64')

In [90]:
homelessness.values

array([['East South Central', 'Alabama', 2570.0, 864.0, 4887681],
       ['Pacific', 'Alaska', 1434.0, 582.0, 735139],
       ['Mountain', 'Arizona', 7259.0, 2606.0, 7158024],
       ['West South Central', 'Arkansas', 2280.0, 432.0, 3009733],
       ['Pacific', 'California', 109008.0, 20964.0, 39461588],
       ['Mountain', 'Colorado', 7607.0, 3250.0, 5691287],
       ['New England', 'Connecticut', 2280.0, 1696.0, 3571520],
       ['South Atlantic', 'Delaware', 708.0, 374.0, 965479],
       ['South Atlantic', 'District of Columbia', 3770.0, 3134.0, 701547],
       ['South Atlantic', 'Florida', 21443.0, 9587.0, 21244317],
       ['South Atlantic', 'Georgia', 6943.0, 2556.0, 10511131],
       ['Pacific', 'Hawaii', 4131.0, 2399.0, 1420593],
       ['Mountain', 'Idaho', 1297.0, 715.0, 1750536],
       ['East North Central', 'Illinois', 6752.0, 3891.0, 12723071],
       ['East North Central', 'Indiana', 3776.0, 1482.0, 6695497],
       ['West North Central', 'Iowa', 1711.0, 1038.0, 3148618],
       ['West North Central', 'Kansas', 1443.0, 773.0, 2911359],
       ['East South Central', 'Kentucky', 2735.0, 953.0, 4461153],
       ['West South Central', 'Louisiana', 2540.0, 519.0, 4659690],
       ['New England', 'Maine', 1450.0, 1066.0, 1339057],
       ['South Atlantic', 'Maryland', 4914.0, 2230.0, 6035802],
       ['New England', 'Massachusetts', 6811.0, 13257.0, 6882635],
       ['East North Central', 'Michigan', 5209.0, 3142.0, 9984072],
       ['West North Central', 'Minnesota', 3993.0, 3250.0, 5606249],
       ['East South Central', 'Mississippi', 1024.0, 328.0, 2981020],
       ['West North Central', 'Missouri', 3776.0, 2107.0, 6121623],
       ['Mountain', 'Montana', 983.0, 422.0, 1060665],
       ['West North Central', 'Nebraska', 1745.0, 676.0, 1925614],
       ['Mountain', 'Nevada', 7058.0, 486.0, 3027341],
       ['New England', 'New Hampshire', 835.0, 615.0, 1353465],
       ['Mid-Atlantic', 'New Jersey', 6048.0, 3350.0, 8886025],
       ['Mountain', 'New Mexico', 1949.0, 602.0, 2092741],
       ['Mid-Atlantic', 'New York', 39827.0, 52070.0, 19530351],
       ['South Atlantic', 'North Carolina', 6451.0, 2817.0, 10381615],
       ['West North Central', 'North Dakota', 467.0, 75.0, 758080],
       ['East North Central', 'Ohio', 6929.0, 3320.0, 11676341],
       ['West South Central', 'Oklahoma', 2823.0, 1048.0, 3940235],
       ['Pacific', 'Oregon', 11139.0, 3337.0, 4181886],
       ['Mid-Atlantic', 'Pennsylvania', 8163.0, 5349.0, 12800922],
       ['New England', 'Rhode Island', 747.0, 354.0, 1058287],
       ['South Atlantic', 'South Carolina', 3082.0, 851.0, 5084156],
       ['West North Central', 'South Dakota', 836.0, 323.0, 878698],
       ['East South Central', 'Tennessee', 6139.0, 1744.0, 6771631],
       ['West South Central', 'Texas', 19199.0, 6111.0, 28628666],
       ['Mountain', 'Utah', 1904.0, 972.0, 3153550],
       ['New England', 'Vermont', 780.0, 511.0, 624358],
       ['South Atlantic', 'Virginia', 3928.0, 2047.0, 8501286],
       ['Pacific', 'Washington', 16424.0, 5880.0, 7523869],
       ['South Atlantic', 'West Virginia', 1021.0, 222.0, 1804291],
       ['East North Central', 'Wisconsin', 2740.0, 2167.0, 5807406],
       ['Mountain', 'Wyoming', 434.0, 205.0, 577601]], dtype=object)

# Sorting

In [91]:
homelessness_ind = homelessness.sort_values('individuals')
homelessness_ind.head()

                region         state  individuals  family_members  state_pop
50            Mountain       Wyoming        434.0           205.0     577601
34  West North Central  North Dakota        467.0            75.0     758080
7       South Atlantic      Delaware        708.0           374.0     965479
39         New England  Rhode Island        747.0           354.0    1058287
45         New England       Vermont        780.0           511.0     624358

In [92]:
largest_homeless_family = homelessness.sort_values('family_members', ascending = False)
largest_homeless_family.head()

                region          state  individuals  family_members  state_pop
32        Mid-Atlantic       New York      39827.0         52070.0   19530351
4              Pacific     California     109008.0         20964.0   39461588
21         New England  Massachusetts       6811.0         13257.0    6882635
9       South Atlantic        Florida      21443.0          9587.0   21244317
43  West South Central          Texas      19199.0          6111.0   28628666

In [93]:
# Sort homelessness by region, then descending family members
homelessness_reg_fam = homelessness.sort_values(['region','family_members'], ascending=[True, False])

# Print the top few rows
homelessness_reg_fam.head()

                region      state  individuals  family_members  state_pop
13  East North Central   Illinois       6752.0          3891.0   12723071
35  East North Central       Ohio       6929.0          3320.0   11676341
22  East North Central   Michigan       5209.0          3142.0    9984072
49  East North Central  Wisconsin       2740.0          2167.0    5807406
14  East North Central    Indiana       3776.0          1482.0    6695497

# Subsetting Columns

In [94]:
# Select the individuals column
individuals = homelessness['individuals']
individuals.head()

0      2570.0
1      1434.0
2      7259.0
3      2280.0
4    109008.0
Name: individuals, dtype: float64

In [95]:
# Select the state and family_members columns
state_fam = homelessness[['state', 'family_members']]

# Print the head of the result
state_fam.head()

        state  family_members
0     Alabama           864.0
1      Alaska           582.0
2     Arizona          2606.0
3    Arkansas           432.0
4  California         20964.0

In [96]:
# Select only the individuals and state columns, in that order
ind_state = homelessness[['individuals', 'state']]

# Print the head of the result
ind_state.head()

   individuals       state
0       2570.0     Alabama
1       1434.0      Alaska
2       7259.0     Arizona
3       2280.0    Arkansas
4     109008.0  California

# Subsetting Rows

In [97]:
temp = homelessness['individuals'] > 10000
print("No of rows returned = " + str(temp.count()), temp.head(), sep="\n")
ind_gt_10k = homelessness[temp]
ind_gt_10k

No of rows returned = 51
0    False
1    False
2    False
3    False
4     True
Name: individuals, dtype: bool

                region       state  individuals  family_members  state_pop
4              Pacific  California     109008.0         20964.0   39461588
9       South Atlantic     Florida      21443.0          9587.0   21244317
32        Mid-Atlantic    New York      39827.0         52070.0   19530351
37             Pacific      Oregon      11139.0          3337.0    4181886
43  West South Central       Texas      19199.0          6111.0   28628666
47             Pacific  Washington      16424.0          5880.0    7523869

In [98]:
# Another shorthand for this is below
ind_gt_10k = homelessness[homelessness['individuals'] > 10000]
ind_gt_10k

                region       state  individuals  family_members  state_pop
4              Pacific  California     109008.0         20964.0   39461588
9       South Atlantic     Florida      21443.0          9587.0   21244317
32        Mid-Atlantic    New York      39827.0         52070.0   19530351
37             Pacific      Oregon      11139.0          3337.0    4181886
43  West South Central       Texas      19199.0          6111.0   28628666
47             Pacific  Washington      16424.0          5880.0    7523869

# Subsetting based on multiple conditions

In [99]:
# Filter for rows where region is Mountain
mountain_reg = homelessness[homelessness['region'] == 'Mountain']

# See the result
mountain_reg

      region       state  individuals  family_members  state_pop
2   Mountain     Arizona       7259.0          2606.0    7158024
5   Mountain    Colorado       7607.0          3250.0    5691287
12  Mountain       Idaho       1297.0           715.0    1750536
26  Mountain     Montana        983.0           422.0    1060665
28  Mountain      Nevada       7058.0           486.0    3027341
31  Mountain  New Mexico       1949.0           602.0    2092741
44  Mountain        Utah       1904.0           972.0    3153550
50  Mountain     Wyoming        434.0           205.0     577601

In [100]:
# Filter for rows where family_members is less than 1000 
# and region is Pacific
fam_lt_1k_pac = homelessness[(homelessness['family_members'] < 1000) & (homelessness['region'] == 'Pacific')]

# See the result
fam_lt_1k_pac

    region   state  individuals  family_members  state_pop
1  Pacific  Alaska       1434.0           582.0     735139

In [101]:
# Subset for rows in South Atlantic or Mid-Atlantic regions
south_mid_atlantic = homelessness[homelessness['region'].isin(['South Atlantic', 'Mid-Atlantic'])].sort_values(['region', 'state'])

# See the result
south_mid_atlantic

,region,state,individuals,family_members,state_pop
30,Mid-Atlantic,New Jersey,6048.0,3350.0,8886025
32,Mid-Atlantic,New York,39827.0,52070.0,19530351
38,Mid-Atlantic,Pennsylvania,8163.0,5349.0,12800922
7,South Atlantic,Delaware,708.0,374.0,965479
8,South Atlantic,District of Columbia,3770.0,3134.0,701547
9,South Atlantic,Florida,21443.0,9587.0,21244317
10,South Atlantic,Georgia,6943.0,2556.0,10511131
20,South Atlantic,Maryland,4914.0,2230.0,6035802
33,South Atlantic,North Carolina,6451.0,2817.0,10381615
40,South Atlantic,South Carolina,3082.0,851.0,5084156
46,South Atlantic,Virginia,3928.0,2047.0,8501286
48,South Atlantic,West Virginia,1021.0,222.0,1804291

In [102]:
# The Mojave Desert states
canu = ["California", "Arizona", "Nevada", "Utah"]

# Filter for rows in the Mojave Desert states
mojave_homelessness = homelessness[homelessness['state'].isin(canu)]

# See the result
print(mojave_homelessness)

      region       state  individuals  family_members  state_pop
2   Mountain     Arizona       7259.0          2606.0    7158024
4    Pacific  California     109008.0         20964.0   39461588
28  Mountain      Nevada       7058.0           486.0    3027341
44  Mountain        Utah       1904.0           972.0    3153550

# Adding new columns to DataFrame

In [107]:
# Add total col as sum of individuals and family_members
homelessness['total'] = homelessness['individuals'] + homelessness['family_members']

# Add p_individuals col as proportion of individuals
homelessness['p_individuals'] = homelessness['individuals'] / homelessness['total']

# See the result
homelessness.head()

,region,state,individuals,family_members,state_pop,total,p_individuals
0,East South Central,Alabama,2570.0,864.0,4887681,3434.0,0.748398
1,Pacific,Alaska,1434.0,582.0,735139,2016.0,0.711310
2,Mountain,Arizona,7259.0,2606.0,7158024,9865.0,0.735834
3,West South Central,Arkansas,2280.0,432.0,3009733,2712.0,0.840708
4,Pacific,California,109008.0,20964.0,39461588,129972.0,0.838704

### Combining it all

In [108]:
# Create indiv_per_10k col as homeless individuals per 10k state pop
homelessness["indiv_per_10k"] = 10000 * homelessness['individuals'] / homelessness['state_pop'] 

# Subset rows for indiv_per_10k greater than 20
high_homelessness = homelessness[homelessness["indiv_per_10k"] > 20]

# Sort high_homelessness by descending indiv_per_10k
high_homelessness_srt = high_homelessness.sort_values('indiv_per_10k', ascending=False)

# From high_homelessness_srt, select the state and indiv_per_10k cols
result = high_homelessness_srt[['state','indiv_per_10k']]

result

                   state  indiv_per_10k
8   District of Columbia      53.738381
11                Hawaii      29.079406
4             California      27.623825
37                Oregon      26.636307
28                Nevada      23.314189
47            Washington      21.829195
32              New York      20.392363